package day03;

/*
	水仙花
	
	需求：
		在控制台输出所有的"水仙花数"，指的是一个三位数，个位、十位、百位的数字立方和等于原数
		例如：153=1*1*1+5*5*5+3*3*3

	思考：任意数字的指定位上的数值如何求
	     先使用【整除】操作将要求的数字移动到【个位】，再使用【取余】操作取出最后一位
*/
public class ForTest04 {
    public static void main(String[] args) {
        //输出所有的水仙花数必然要使用到循环，遍历所有的三位数，三位数从100开始，到999结束
		/*
		for(int i=100; i<=999; i++) {
			
		}
		*/
        for (int i = 100; i < 1000; i++) {
            //在计算之前获取三位数中每个位上的值
            int ge = i % 10;
            int shi = i / 10 % 10;
            int bai = i / 10 / 10 % 10;//或者i/100

            //判定条件是将三位数中的每个数值取出来，计算立方和后与原始数字比较是否相等
            if (ge * ge * ge + shi * shi * shi + bai * bai * bai == i) {
                //输出满足条件的数字就是水仙花数
                System.out.println(i);
            }
        }
    }
}